In [ ]:
Q1. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.

In [8]:
import pandas as pd
data = [4, 8, 15, 16, 23, 42]
series = pd.Series(data)
print(series)

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

In [ ]:
Create a Pandas DataFrame that contains the following data:
    Then, print the DataFrame.

In [9]:
import pandas as pd
data = {
    'Name': ['Alice', 'Bob', 'Claire'],
    'Age': [25, 30, 27],
    'Gender': ['Female', 'Male', 'Female']
}
df = pd.DataFrame(data)
print(df)

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

In [ ]:
Q4. What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.

In [ ]:
a DataFrame is a 2-dimensional data structure designed for handling tabular data with multiple columns

Series is a 1-dimensional data structure used to represent a single column or row of data within a DataFrame

In [10]:
import pandas as pd
series_data = pd.Series([1, 2, 3, 4, 5])
df_data = pd.DataFrame({'A': [1, 2, 3, 4, 5], 'B': [6, 7, 8, 9, 10]})
print("Series:")
print(series_data)
print("DataFrame:")
print(df_data)

Series:
0    1
1    2
2    3
3    4
4    5
dtype: int64
DataFrame:
   A   B
0  1   6
1  2   7
2  3   8
3  4   9
4  5  10

In [ ]:
Q5. What are some common functions you can use to manipulate data in a Pandas DataFrame? Can
you give an example of when you might use one of these functions?

In [11]:
df=pd.read_csv("services.csv")

In [12]:
df.head(1)

,id,location_id,program_id,accepted_payments,alternate_name,application_process,audience,description,eligibility,email,...,interpretation_services,keywords,languages,name,required_documents,service_areas,status,wait_time,website,taxonomy_ids
0,1,1,NaN,NaN,NaN,Walk in or apply by phone.,"Older adults age 55 or over, ethnic minorities...",A walk-in center for older adults that provide...,"Age 55 or over for most programs, age 60 or ov...",NaN,...,NaN,"ADULT PROTECTION AND CARE SERVICES, Meal Sites...",NaN,Fair Oaks Adult Activity Center,NaN,Colma,active,No wait.,NaN,NaN

In [13]:
df.tail(1)

,id,location_id,program_id,accepted_payments,alternate_name,application_process,audience,description,eligibility,email,...,interpretation_services,keywords,languages,name,required_documents,service_areas,status,wait_time,website,taxonomy_ids
22,23,22,NaN,NaN,NaN,Walk in or apply by phone or mail,"Second service and nonprofit businesses, the p...",[NOTE THIS IS NOT A REAL ORGANIZATION--THIS IS...,None,NaN,...,NaN,"Ruby on Rails/Postgres/Redis, testing, wic",NaN,Example Service Name,NaN,"San Mateo County, Alameda County",active,No wait to 2 weeks,http://www.example.com,NaN

In [15]:
df.columns

Index(['id', 'location_id', 'program_id', 'accepted_payments',
       'alternate_name', 'application_process', 'audience', 'description',
       'eligibility', 'email', 'fees', 'funding_sources',
       'interpretation_services', 'keywords', 'languages', 'name',
       'required_documents', 'service_areas', 'status', 'wait_time', 'website',
       'taxonomy_ids'],
      dtype='object')

In [16]:
df.dtypes

id                           int64
location_id                  int64
program_id                 float64
accepted_payments           object
alternate_name              object
application_process         object
audience                    object
description                 object
eligibility                 object
email                       object
fees                        object
funding_sources             object
interpretation_services     object
keywords                    object
languages                   object
name                        object
required_documents          object
service_areas               object
status                      object
wait_time                   object
website                     object
taxonomy_ids                object
dtype: object

In [17]:
df[['website','keywords']]

                   website                                           keywords
0                      NaN  ADULT PROTECTION AND CARE SERVICES, Meal Sites...
1                      NaN  EMPLOYMENT/TRAINING SERVICES, Job Development,...
2                      NaN  Geriatric Counseling, Older Adults, Gay, Lesbi...
3                      NaN  INDIVIDUAL AND FAMILY DEVELOPMENT SERVICES, Gr...
4                      NaN     COMMUNITY SERVICES, Speakers, Automobile Loans
5                      NaN  ADULT PROTECTION AND CARE SERVICES, In-Home Su...
6                      NaN  ADULT PROTECTION AND CARE SERVICES, Adult Day ...
7                      NaN  ADULT PROTECTION AND CARE SERVICES, Meal Sites...
8                      NaN  EDUCATION SERVICES, Library, Libraries, Public...
9                      NaN  EDUCATION SERVICES, Library, Libraries, Public...
10                     NaN  EDUCATION SERVICES, Library, Libraries, Public...
11                     NaN  EDUCATION SERVICES, Adult, Alternative, Litera...
12                     NaN  EDUCATION SERVICES, Library, Libraries, Public...
13                     NaN  COMMUNITY SERVICES, Interpretation/Translation...
14                     NaN  ALCOHOLISM SERVICES, Residential Care, DRUG AB...
15                     NaN  COMMODITY SERVICES, Clothing/Personal Items, C...
16                     NaN  COMMODITY SERVICES, Clothing/Personal Items, C...
17                     NaN  HEALTH SERVICES, Outpatient Care, Community Cl...
18                     NaN  HEALTH SERVICES, Outpatient Care, Community Cl...
19                     NaN                                                NaN
20                     NaN                                                NaN
21  http://www.example.com                                    Salud, Medicina
22  http://www.example.com         Ruby on Rails/Postgres/Redis, testing, wic

In [ ]:
Q6. Which of the following is mutable in nature Series, DataFrame, Panel?

In [ ]:
Among Series, DataFrame, and Panel, only DataFrame is mutable in nature.
Series: 
Series is immutable. Once created, you cannot modify the elements in a Series directly.we need to create a new Series
if you want to change the values.

DataFrame: 
    DataFrame is mutable. it can be modified.

Panel:
    Panel is  similar to DataFrame, Panel is also mutable. it can modify the data and structure of a Panel.

In [ ]:
Q7. Create a DataFrame using multiple Series. Explain with an example.

In [18]:
import pandas as pd
name_series = pd.Series(['Jack', 'Emily', 'Tom', 'Alice'])
age_series = pd.Series([30, 25, 35, 28])
city_series = pd.Series(['New York', 'Los Angeles', 'Chicago', 'Houston'])
df = pd.DataFrame({'Name': name_series, 'Age': age_series, 'City': city_series})
print(df)

    Name  Age         City
0   Jack   30     New York
1  Emily   25  Los Angeles
2    Tom   35      Chicago
3  Alice   28      Houston